# StartShortening Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralElementDefinitionData..::..StartShortening Property
StructuralElementDefinitionData Class See Also
---
Cutback or extension at element curve start.
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public double StartShortening { get; }
```

Visual Basic
---
```text
Public ReadOnly Property StartShortening As Double
	Get
```

Visual C++
---
```text
public:
property double StartShortening {
	double get ();
}
```

# See Also
StructuralElementDefinitionData Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace